{
  "scenario_id": "demo_siege",
  "name": "Fortress Siege Demo Script",
  "description": "Scripted five-turn experience that guarantees the demo advances even if models fail.",
  "turns": [
    {
      "turn": 1,
      "title": "predictive_setup",
      "summary": "Engine primes defensive barriers, lanterns pulse and distant siege drums echo.",
      "fallback": {
        "narrative": "Sentinel pylons bloom with orange wards while scouts chart every breach lane.",
        "actions": [
          "Raise barricades along the northern wall.",
          "Dim the courtyard lamps and focus lantern beams outward.",
          "Pipe in the distant howl of war horns to foreshadow the siege."
        ]
      }
    },
    {
      "turn": 2,
      "title": "scout_report",
      "summary": "Recon patrols slip back through the smoke with measured intelligence.",
      "fallback": {
        "narrative": "Ila's scout band spills a parchment of siege tower schematics and whisper about tunneling foes.",
        "actions": [
          "Surface a guaranteed intel event about enemy troop movements.",
          "Mark weak lattice sections for engineers to reinforce.",
          "Flag a calm-but-tense atmosphere with rustling pennants."
        ]
      }
    },
    {
      "turn": 3,
      "title": "civilian_evac",
      "summary": "Town criers move civilians to inner keeps before bombardments begin.",
      "fallback": {
        "narrative": "Bell towers chime thrice and messengers herd families through the underpass tunnels.",
        "actions": [
          "Queue a UI broadcast reminding players to secure non-combatants.",
          "Guarantee at least one logistics option remains selectable.",
          "Overlay audio hints of muffled panic to keep tension up."
        ]
      }
    },
    {
      "turn": 4,
      "title": "low_conflict",
      "summary": "Resolve a controlled skirmish via scripted combat fallback.",
      "fallback": {
        "narrative": "A raider probe tests the barricades—defenders answer with warning bolts and crackling oil.",
        "actions": [
          "Invoke resolve_combat fallback with deterministic casualty numbers.",
          "Update threat meters without touching core morale.",
          "Spawn a breach marker that the UI can highlight."
        ]
      }
    },
    {
      "turn": 5,
      "title": "finale_setup",
      "summary": "Stage the mini-finale hook to promise a cliffhanger.",
      "fallback": {
        "narrative": "Engineers align crystal cannons while the captain orders one decisive countercharge rehearsal.",
        "actions": [
          "Lock in a cinematic directive for the last stand.",
          "Refresh atmosphere cues with smoky light shafts.",
          "Ensure at least one NPC movement is showcased on the plaza."
        ]
      }
    }
  ]
}
